{
  "first_aid": [
    {
      "title": "Burns",
      "steps": [
        "Cool the burn under running water for at least 10-20 minutes.",
        "Remove jewelry and tight clothing before swelling starts.",
        "Do not apply ice, butter, or ointments.",
        "Cover with clean, non-stick dressing or plastic wrap.",
        "Take over-the-counter pain reliever if needed.",
        "Seek medical care for severe burns, large burns, or burns on face/hands/joints."
      ]
    },
    {
      "title": "Cuts and Wounds",
      "steps": [
        "Apply direct pressure with clean cloth for 10 minutes.",
        "Clean the wound gently with clean water (avoid hydrogen peroxide).",
        "Apply antibiotic ointment if available.",
        "Cover with sterile bandage or gauze.",
        "Change dressing daily and watch for signs of infection.",
        "Seek medical care if bleeding doesn't stop, wound is deep, or caused by dirty object."
      ]
    },
    {
      "title": "Nosebleed",
      "steps": [
        "Sit upright and lean slightly forward.",
        "Pinch the soft part of nose firmly for 10-15 minutes.",
        "Breathe through your mouth.",
        "Avoid tilting head back (causes blood to flow into throat).",
        "Apply cold compress to bridge of nose.",
        "Avoid blowing nose for several hours after bleeding stops.",
        "Seek medical care if bleeding lasts more than 20 minutes."
      ]
    },
    {
      "title": "Choking",
      "steps": [
        "If person can cough or speak, encourage continued coughing.",
        "If unable to breathe, perform Heimlich maneuver.",
        "Stand behind person, wrap arms around waist.",
        "Make a fist above navel, grasp with other hand.",
        "Give quick upward thrusts until object is expelled.",
        "For infants, use back blows and chest thrusts instead.",
        "Call emergency services if object cannot be removed."
      ]
    },
    {
      "title": "Sprains and Strains",
      "steps": [
        "Rest: Avoid using the injured area.",
        "Ice: Apply ice pack for 20 minutes every 2-3 hours for first 48 hours.",
        "Compression: Wrap with elastic bandage (not too tight).",
        "Elevation: Keep injured area above heart level.",
        "Take over-the-counter pain medication if needed.",
        "Seek medical care if severe pain, unable to bear weight, or no improvement in 48 hours."
      ]
    },
    {
      "title": "Insect Stings",
      "steps": [
        "Remove stinger by scraping with credit card (don't use tweezers).",
        "Wash area with soap and water.",
        "Apply cold compress to reduce swelling.",
        "Take antihistamine for itching.",
        "Apply hydrocortisone cream if available.",
        "Watch for signs of allergic reaction (difficulty breathing, swelling of face/throat).",
        "Call emergency services immediately if severe allergic reaction occurs."
      ]
    },
    {
      "title": "Heat Exhaustion",
      "steps": [
        "Move person to cool, shaded area immediately.",
        "Remove excess clothing.",
        "Give cool water or sports drink (sip slowly).",
        "Apply cool, wet cloths to skin or spray with cool water.",
        "Fan the person to promote cooling.",
        "Have person lie down with legs elevated.",
        "Call emergency services if symptoms worsen or person becomes confused."
      ]
    },
    {
      "title": "Seizures",
      "steps": [
        "Stay calm and time the seizure.",
        "Clear area of hard or sharp objects.",
        "Turn person on side to keep airway clear.",
        "Place something soft under head.",
        "Do NOT restrain person or put anything in mouth.",
        "Stay with person until fully conscious.",
        "Call emergency services if seizure lasts more than 5 minutes or person has multiple seizures."
      ]
    }
  ]
}